In [1]:
# Importing Dependencies
import pandas as pd

In [2]:
# Load the CSV file into a pandas dataframe
df = pd.read_csv("Bx_Books/BX-Users.csv", delimiter=";", error_bad_lines=False, encoding='ISO-8859-1')

C:\Users\reyne\AppData\Local\Temp\ipykernel_22204\417389913.py:2: FutureWarning: The error_bad_lines argument has been deprecated and will be removed in a future version. Use on_bad_lines in the future.


  df = pd.read_csv("Bx_Books/BX-Users.csv", delimiter=";", error_bad_lines=False, encoding='ISO-8859-1')

In [3]:
df

        User-ID                            Location   Age
0             1                  nyc, new york, usa   NaN
1             2           stockton, california, usa  18.0
2             3     moscow, yukon territory, russia   NaN
3             4           porto, v.n.gaia, portugal  17.0
4             5  farnborough, hants, united kingdom   NaN
...         ...                                 ...   ...
278853   278854               portland, oregon, usa   NaN
278854   278855  tacoma, washington, united kingdom  50.0
278855   278856           brampton, ontario, canada   NaN
278856   278857           knoxville, tennessee, usa   NaN
278857   278858                dublin, n/a, ireland   NaN

[278858 rows x 3 columns]

In [5]:
# Count the number of missing values in each column
null = df.isna().sum()

# Display the null count for each column
print(null)

User-ID          0
Location         0
Age         110762
dtype: int64

In [7]:
# Removing rows with missing values
df = df.dropna()

In [10]:
# Verify that there are no more missing values
null2 = df.isna().sum().sum()
print("Number of missing values:", null2)

Number of missing values: 0

In [6]:
# Check if there are any duplicates in the DataFrame
duplicates = df.duplicated().sum()

# Display the number of duplicates
print("Number of duplicates:", duplicates)

Number of duplicates: 0

In [11]:
# Save the cleaned data to a new CSV file
df.to_csv("BX_books/Cleaned_BX-Users.csv", index=False)

In [12]:
df

        User-ID                            Location   Age
1             2           stockton, california, usa  18.0
3             4           porto, v.n.gaia, portugal  17.0
5             6       santa monica, california, usa  61.0
9            10          albacete, wisconsin, spain  26.0
10           11      melbourne, victoria, australia  14.0
...         ...                                 ...   ...
278848   278849         georgetown, ontario, canada  23.0
278850   278851                  dallas, texas, usa  33.0
278851   278852     brisbane, queensland, australia  32.0
278852   278853      stranraer, n/a, united kingdom  17.0
278854   278855  tacoma, washington, united kingdom  50.0

[168096 rows x 3 columns]